Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.IsSelfsynchronizing
Indicates whether the service's record of used services (in a particular document)
can independently wary between local clients and the corresponding central model.
It is then up to the service's owner to assure proper local-central synchronization.
Remarks:
This property is ignored unless the service is also recordable.
Declaring a service as self-synchronizing makes the service bypass standard
worksharing checks during local-central synchronizations. What it means is that
should there be any disparity found between the list of servers used in the local
file and those used in the central file, they would get ignored; it would be
assumed that the owner of the service takes other steps to ensure the local and
the central data are in sync.
Few services should need to set this property as True, for self-synchronizing
services are very rare, practically limited only to those which operate on element
level.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.IsRecordable
Indicates whether executions of the service is recorded in documents or not.
Remarks:
When a recordable service is executed in a document, a record about the executed
server (or servers) is stored in the document's history. This allows active servers
to be synchronized next time a saved document is opened in Revit.
Executions of a recordable service in a document must happen inside a transaction.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.IsPublic
This property denotes a service as either public or private.
Remarks:
A public service can be executed by anyone, while a private
service can be execute only by the caller who registered it
(the owner of the service, typically), or by someone who has
access to the service's execution key.
Unless specified otherwise, all services are created
as private by default.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.#ctor
Constructs a new ExternalServiceOptions with default settings.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalServiceOptions
Various options affecting the behavior of an External Service
Remarks:
Options are provided at the time of registering a service.
After a service is registered, the options cannot be changed.
Since:
2014